app/controllers/amenities_controller.rb

    def index
      @amenities = Amenity.all
---
SELECT "amenities".* FROM "amenities"