app/controllers/attractions_controller.rb

SELECT "attractions".* FROM "attractions"
---
    def index
      @attractions = Attraction.all