app/controllers/bookings_controller.rb

    def create
      @booking = Booking.new(booking_params)
      if @booking.save
---
INSERT INTO "bookings" ("service_id", "guest_id", "created_at", "updated_at", "booking_date", "booking_time", "num_of_guests") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"