app/controllers/guests_controller.rb

SELECT "guests".* FROM "guests"
---
  def index
    @guests = Guest.all

SELECT  "guests".* FROM "guests" WHERE "guests"."guest_name" = $1 AND "guests"."hotel_booking_id" = $2 LIMIT $3  [["guest_name", "Russel Lynwood"], ["hotel_booking_id", 5513], ["LIMIT", 1]]
---
  def login
    @guest = Guest.find_by(
      guest_name: params[:guest_name],
      hotel_booking_id: params[:hotel_booking_id]
    )

SELECT  "guests".* FROM "guests" WHERE "guests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_guest
    @guest = Guest.find(params[:id])